Tekla Open API Reference for Tekla Structures 2025
AABB.Addition Operator
Overload List
Name | Description
Addition(AABB, AABB)
 Combines (adds) the given two axis-aligned 3d bounding boxes.
Addition(AABB, Point)
 Adds the given point to the given axis-aligned 3d bounding box.
Addition(Point, AABB)
 Adds the given point to the given axis-aligned 3d bounding box.
Top
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace